In [2]:
print('Welcome to Pandas  !!!')

Welcome to Pandas  !!!

In [3]:
import pandas as pd

## To read file in your system

In [10]:
df = pd.read_csv(r'C:\Users\Yogi\Downloads\Salaries.csv')
print(df)

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

## To read an online data file

In [25]:
df = pd.read_csv("https://bitbucket.org/ntpl_sylvester/dataset/raw/467616310ddfaf8abbbbc13bdf1e32cdf0842cbd/Salaries.csv")
print(df)

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [14]:
df.describe()

             phd    service         salary
count  76.000000  78.000000      76.000000
mean   19.605263  15.051282  108003.355263
std    12.508215  12.139768   28525.350088
min     1.000000   0.000000   57800.000000
25%    10.000000   5.250000   87250.000000
50%    18.500000  14.500000  104671.000000
75%    27.250000  20.750000  127077.750000
max    56.000000  51.000000  186960.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
rank          78 non-null object
discipline    78 non-null object
phd           76 non-null float64
service       78 non-null int64
sex           78 non-null object
salary        76 non-null float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.8+ KB

In [65]:
df.ndim                                            # gives dimentions of data

2

In [69]:
df.shape

(78, 6)

In [70]:
df.size

468

In [17]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [71]:
df.head(10)

        rank discipline   phd  service   sex    salary
0       Prof          B  56.0       49  Male  186960.0
1       Prof          A  12.0        6  Male   93000.0
2       Prof          A  23.0       20  Male  110515.0
3       Prof          A  40.0       31  Male  131205.0
4       Prof          B  20.0       18  Male  104800.0
5       Prof          A  20.0       20  Male  122400.0
6  AssocProf          A  20.0       17  Male   81285.0
7       Prof          A  18.0       18  Male       NaN
8       Prof          A  29.0       19  Male   94350.0
9       Prof          A  51.0       51  Male   57800.0

In [16]:
df.tail()

         rank discipline   phd  service     sex    salary
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [72]:
df.tail(10)

         rank discipline   phd  service     sex    salary
68   AsstProf          A   4.0        2  Female   77500.0
69       Prof          A  28.0        7  Female  116450.0
70   AsstProf          A   8.0        3  Female   78500.0
71  AssocProf          B  12.0        9  Female   71065.0
72       Prof          B  24.0       15  Female  161101.0
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

In [73]:
df.index

RangeIndex(start=0, stop=78, step=1)

In [74]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [77]:
df.dtypes

rank           object
discipline     object
phd           float64
service         int64
sex            object
salary        float64
dtype: object

In [78]:
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [79]:
df.values

array([['Prof', 'B', 56.0, 49, 'Male', 186960.0],
       ['Prof', 'A', 12.0, 6, 'Male', 93000.0],
       ['Prof', 'A', 23.0, 20, 'Male', 110515.0],
       ['Prof', 'A', 40.0, 31, 'Male', 131205.0],
       ['Prof', 'B', 20.0, 18, 'Male', 104800.0],
       ['Prof', 'A', 20.0, 20, 'Male', 122400.0],
       ['AssocProf', 'A', 20.0, 17, 'Male', 81285.0],
       ['Prof', 'A', 18.0, 18, 'Male', nan],
       ['Prof', 'A', 29.0, 19, 'Male', 94350.0],
       ['Prof', 'A', 51.0, 51, 'Male', 57800.0],
       ['Prof', 'B', 39.0, 33, 'Male', 128250.0],
       ['Prof', 'B', 23.0, 23, 'Male', 134778.0],
       ['AsstProf', 'B', 1.0, 0, 'Male', 88000.0],
       ['Prof', 'B', nan, 33, 'Male', 162200.0],
       ['Prof', 'B', 25.0, 19, 'Male', 153750.0],
       ['Prof', 'B', 17.0, 3, 'Male', 150480.0],
       ['AsstProf', 'B', 8.0, 3, 'Male', 75044.0],
       ['AsstProf', 'B', 4.0, 0, 'Male', 92000.0],
       ['Prof', 'A', 19.0, 7, 'Male', 107300.0],
       ['Prof', 'A', 29.0, 27, 'Male', 150500.0],
       ['AsstProf', 'B', 4.0, 4, 'Male', 92000.0],
       ['Prof', 'A', 33.0, 30, 'Male', 103106.0],
       ['AsstProf', 'A', 4.0, 2, 'Male', 73000.0],
       ['AsstProf', 'A', 2.0, 0, 'Male', 85000.0],
       ['Prof', 'A', 30.0, 23, 'Male', 91100.0],
       ['Prof', 'B', 35.0, 31, 'Male', 99418.0],
       ['Prof', 'A', 38.0, 19, 'Male', 148750.0],
       ['Prof', 'A', 45.0, 43, 'Male', 155865.0],
       ['AsstProf', 'B', 7.0, 2, 'Male', nan],
       ['Prof', 'B', 21.0, 20, 'Male', 123683.0],
       ['AssocProf', 'B', 9.0, 7, 'Male', 107008.0],
       ['Prof', 'B', 22.0, 21, 'Male', 155750.0],
       ['Prof', 'A', 27.0, 19, 'Male', 103275.0],
       ['Prof', 'B', 18.0, 18, 'Male', 120000.0],
       ['AssocProf', 'B', nan, 8, 'Male', 119800.0],
       ['Prof', 'B', 28.0, 23, 'Male', 126933.0],
       ['Prof', 'B', 45.0, 45, 'Male', 146856.0],
       ['Prof', 'A', 20.0, 8, 'Male', 102000.0],
       ['AsstProf', 'B', 4.0, 3, 'Male', 91000.0],
       ['Prof', 'B', 18.0, 18, 'Female', 129000.0],
       ['Prof', 'A', 39.0, 36, 'Female', 137000.0],
       ['AssocProf', 'A', 13.0, 8, 'Female', 74830.0],
       ['AsstProf', 'B', 4.0, 2, 'Female', 80225.0],
       ['AsstProf', 'B', 5.0, 0, 'Female', 77000.0],
       ['Prof', 'B', 23.0, 19, 'Female', 151768.0],
       ['Prof', 'B', 25.0, 25, 'Female', 140096.0],
       ['AsstProf', 'B', 11.0, 3, 'Female', 74692.0],
       ['AssocProf', 'B', 11.0, 11, 'Female', 103613.0],
       ['Prof', 'B', 17.0, 17, 'Female', 111512.0],
       ['Prof', 'B', 17.0, 18, 'Female', 122960.0],
       ['AsstProf', 'B', 10.0, 5, 'Female', 97032.0],
       ['Prof', 'B', 20.0, 14, 'Female', 127512.0],
       ['Prof', 'A', 12.0, 0, 'Female', 105000.0],
       ['AsstProf', 'A', 5.0, 3, 'Female', 73500.0],
       ['AssocProf', 'A', 25.0, 22, 'Female', 62884.0],
       ['AsstProf', 'A', 2.0, 0, 'Female', 72500.0],
       ['AssocProf', 'A', 10.0, 8, 'Female', 77500.0],
       ['AsstProf', 'A', 3.0, 1, 'Female', 72500.0],
       ['Prof', 'B', 36.0, 26, 'Female', 144651.0],
       ['AssocProf', 'B', 12.0, 10, 'Female', 103994.0],
       ['AsstProf', 'B', 3.0, 3, 'Female', 92000.0],
       ['AssocProf', 'B', 13.0, 10, 'Female', 103750.0],
       ['AssocProf', 'B', 14.0, 7, 'Female', 109650.0],
       ['Prof', 'A', 29.0, 27, 'Female', 91000.0],
       ['AssocProf', 'A', 26.0, 24, 'Female', 73300.0],
       ['Prof', 'A', 36.0, 19, 'Female', 117555.0],
       ['AsstProf', 'A', 7.0, 6, 'Female', 63100.0],
       ['Prof', 'A', 17.0, 11, 'Female', 90450.0],
       ['AsstProf', 'A', 4.0, 2, 'Female', 77500.0],
       ['Prof', 'A', 28.0, 7, 'Female', 116450.0],
       ['AsstProf', 'A', 8.0, 3, 'Female', 78500.0],
       ['AssocProf', 'B', 12.0, 9, 'Female', 71065.0],
       ['Prof', 'B', 24.0, 15, 'Female', 161101.0],
       ['Prof', 'B', 18.0, 10, 'Female', 105450.0],
       ['AssocProf', 'B', 19.0, 6, 'Female', 104542.0],
       ['Prof', 'B', 17.0, 17, 'Female', 124312.0],
       ['Prof', 'A', 28.0, 14, 'Female', 109954.0],
       ['Prof', 'A', 23.0, 15, 'Female', 109646.0]], dtype=object)

In [81]:
df.describe()                                       # gives only numeric data

             phd    service         salary
count  76.000000  78.000000      76.000000
mean   19.605263  15.051282  108003.355263
std    12.508215  12.139768   28525.350088
min     1.000000   0.000000   57800.000000
25%    10.000000   5.250000   87250.000000
50%    18.500000  14.500000  104671.000000
75%    27.250000  20.750000  127077.750000
max    56.000000  51.000000  186960.000000

In [83]:
df.describe(include=['object', 'float64', 'int64'])  # will give non numeric data also

        rank discipline        phd    service     sex         salary
count     78         78  76.000000  78.000000      78      76.000000
unique     3          2        NaN        NaN       2            NaN
top     Prof          B        NaN        NaN  Female            NaN
freq      46         42        NaN        NaN      39            NaN
mean     NaN        NaN  19.605263  15.051282     NaN  108003.355263
std      NaN        NaN  12.508215  12.139768     NaN   28525.350088
min      NaN        NaN   1.000000   0.000000     NaN   57800.000000
25%      NaN        NaN  10.000000   5.250000     NaN   87250.000000
50%      NaN        NaN  18.500000  14.500000     NaN  104671.000000
75%      NaN        NaN  27.250000  20.750000     NaN  127077.750000
max      NaN        NaN  56.000000  51.000000     NaN  186960.000000

In [84]:
df.max()                                         # max of all features

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object